/*
	改写代码清单5-13的程序，将两次考试的分数存储在三维数组tensu中。 
	求4名学生在两次考试中3门课程的总分并显示
*/

#include <stdio.h>

int main(void)
{
	int i, j, k;
//	int tenus1[4][3]={{91, 63, 78},{67, 72, 46},{89, 34, 53},{32, 54, 34}};
//	int tenus2[4][3]={{97, 67, 82},{73, 43, 46},{97, 56, 21},{85, 46, 35}};
	int tenus[2][4][3]={{{91, 63, 78},{67, 72, 46},{89, 34, 53},{32, 54, 34}},{{97, 67, 82},{73, 43, 46},{97, 56, 21},{85, 46, 35}}};
	int sum[2][4][3];
	
	/*求两次考试的分数之和*/
	for(i=0; i<2; i++){	
		for(j=0; j<4; j++){
			for(k=0; k<3; k++){
				sum[i][j][k]+=tenus[i][j][k];
			}
			
		}
	}
	/*显示第一次考试的分数*/ 
	puts("第一次考试的分数");	
	
		for(j=0; j<4; j++){
			for(k=0; k<3; k++){
				printf("%4d",tenus[0][j][k]);
			}
			printf("\n");		
		}
		printf("\n");

	
	/*显示第二次考试的分数*/
	puts("第二次考试的分数");
		for(j=0; j<4; j++){
			for(k=0; k<3; k++){
				printf("%4d",tenus[1][j][k]);
			}
			printf("\n");	
		}
		printf("\n");
	
	/*显示总分*/
	puts("总分");

		for(j=0; j<4; j++){
			for(k=0; k<3; k++){
				printf("%4d ",sum[0][j][k]);
			}
			printf("\n");
		}

	return 0;
	
}